const f = require('../loop-04.js');

QUnit.test("ЗАДАЧА 04. Написать f(n), которая возвращает текстовую пирамиду из решеток и пробелов высоты n (1 <= n <= 20)", function(assert){
	assert.deepEqual(f(3),"   #\n  ###\n #####\n", "ERROR")
	assert.deepEqual(f(20.1),"Выберите числа от 1-го до 20-ти", "ERROR")
	assert.deepEqual(f(1)," #\n", "ERROR")
	assert.deepEqual(f(20),"                    #\n                   ###\n                  #####\n                 #######\n                #########\n               ###########\n              #############\n             ###############\n            #################\n           ###################\n          #####################\n         #######################\n        #########################\n       ###########################\n      #############################\n     ###############################\n    #################################\n   ###################################\n  #####################################\n #######################################\n", "ERROR")

});